Public Attributes | List of all members
API_SavePars_Archive Struct Reference
Project Operations
Parameters to save the current project as archive file. More...
#include <APIdefs_Automate.h>
 Public Attributes
 bool  | picturesInTIFF
Save pict/bmp files for readable on both (Mac/Win) platforms.
 bool  | texturesOn
Include linked Textures while saving the archive.
 bool  | backgroundPictOn
Include Background Picture while saving archive.
 bool  | propertiesOn
Include All Properties Library Parts while saving the archive.
 bool  | libraryPartsOn
Include Full Library while saving the archive.
Detailed Description
Parameters to save the current project as archive file.
Remarks
: To utilize this structure, see the ACAPI_ProjectOperation_Save automation function.